{
    "introduction": [
        "Amity University has a total of 9 universities spread across India, 14 overseas/international campuses, 13 B-Schools in India, and 26 pre-schools and schools. Amity University Noida is recognised by the UGC, AICTE, AIU, ACU, Ministry of HRD, DISR, Ministry of Science Technology, and Central Counselling Board. It is accredited with an 'A' Grade by the NAAC, Distance Education Council, BCI, National Council of Teachers Education, Council of Architecture, IET, and UNWTO among others. Amity Noida is included in the list that is maintained by the IAU and is certified by the UK's Quality Assurance Agency in Higher Education.",
        "The university is ISO certified and is a Member of the International Association of Universities.  Internationally, Amity University is ranked 1001-1200 by the QS World University Rankings 2025 under the 'World University' category.  Amity University Noida has been ranked 30 and 29 under the 'Engineering' and 'Management' categories, respectively, by the NIRF Ranking 2024.  Amity Noida offers UG, PG, diploma, and other courses to students across the Arts, Commerce, Science, Design, Management, Education, Law, and other streams.  In addition to the full-time programmes, the university also offers distance learning and online courses to students"
    ],
    "nirf_rank": "30",
    "nirf_category": "Engineering",
    "admission_details": "The flagship programmes offered at Amity University Noida are BTech, MTech, and MBA. The college offers these programmes to students at UG and PG levels. Further, the college offers these programmes for a duration of 4 and 2 years, respectively with a comprehensive curriculum. Amity University courses strive to enhance the learning experience of students in order to prepare them for the industry",
    "course_offer": "Amity University Noida admissions 2024 are open for all UG and PG courses. Interested candidates can check and apply through the official website. Amity Noida offers admission is both entrance and direct. Admission to MBA is based on a valid score of entrance exams such as CAT/ MAT/ XAT/ CMAT/ GMAT/ NMAT other than that all direct admission is offered based on the merit performance of candidates. There is a PI round conducted for each course, which is mandatory to qualify"
}