{
    "introduction": [
        "Indian Institute of Technology Delhi (more popularly known as IIT Delhi) is one of the most prestigious universities in India. IIT Delhi has been ranked 4 under the 'Overall' category and 2 under the 'Engineering' category by the NIRF Ranking 2024. The institute has also ranked 1st by India Today 2023 under the Engineering category, and 1st by the India Today 2023 under the Engineering (Government) category. IIT Delhi is popular for its flagship programmes, i.e. MTech and BTech courses.",
        "IITD was established in 1961 as the College of Engineering.  Later, it was declared the Institution of National Importance under the Institutes of Technology (Amendment) Act of 1963.  Over the years, over 48,000 students have graduated from the IIT Delhi in several disciplines including Physical Sciences, Engineering, Management, and Humanities and Social Sciences, and various other streams.  Over 15,738 students have received their BTech degree from IIT Delhi over the years.  Indian Institute of Technology Delhi (IIT Delhi), through various departments and schools of study, offers UG, PG, and various other courses to students.  IIT Delhi is also ranked 150 internationally by the QS World University Rankings 2025.  It is one of the twenty-three IITs present in India"
    ],
    "nirf_rank": "2",
    "nirf_category": "Engineering",
    "admission_details": "Candidates willing to get admission to various courses must apply online on the official website. At the UG level, the Indian Institute of Technology Delhi (IIT Delhi) offers BTech and various other courses to students. At the PG level, the Indian Institute of Technology Delhi (IIT Delhi) offers MTech, MSc, MDes, and various other courses to students",
    "course_offer": "The mode of Indian Institute of Technology Delhi (IIT Delhi) admission is online. Admission to various courses is based on merit and entrance exam scores. The accepted entrance exams are JEE Main, JEE Advanced, and others. Candidates willing to get admission to various courses must apply online on the official website. Select the required course and pay the application fee. Fill out and submit the application form with the required information"
}